13.0/repository/sunat_fact/models/xml/XMLrequests/getStatus.XML

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.sunat.gob.pe" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
   <soapenv:Header>
   <wsse:Security>
   <wsse:UsernameToken>
   <wsse:Username>20603408111MODDATOS</wsse:Username>
   <wsse:Password>moddatos</wsse:Password>
   </wsse:UsernameToken>
   </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <ser:getStatus>
         <!--Optional:-->
         <ticket>1616342507446</ticket>
      </ser:getStatus>
   </soapenv:Body>
</soapenv:Envelope>