intranet/system/envia.xml

<soapenv:Envelope xmlns:ser="http://service.sunat.gob.pe"
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext1.0.xsd">
 <soapenv:Header>
 <wsse:Security>
 <wsse:UsernameToken>
 <wsse:Username>20100066603MODDATOS</wsse:Username>
 <wsse:Password>moddatos</wsse:Password>
 </wsse:UsernameToken>
 </wsse:Security>
 </soapenv:Header>
 <soapenv:Body>
 <ser:getStatus>
 <rucComprobante>1028308796</rucComprobante>
 <tipoComprobante>01</tipoComprobante>
 <serieComprobante>f213</serieComprobante>
 <numeroComprobante>12345</numeroComprobante>
 </ser:getStatus>
 </soapenv:Body>
</soapenv:Envelope>