avatar/src/main/resources/req/request_2.txt

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
   <SOAP-ENV:Header xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope">
      <wsse:Security>
         <wsse:UsernameToken>
            <wsse:Username>20478005017YESSICA1</wsse:Username>
            <wsse:Password>OseServer2</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
   </SOAP-ENV:Header>
   <SOAP-ENV:Body>
      <m:getStatusCdr xmlns:m="http://service.sunat.gob.pe">
         <rucComprobante>RUC</rucComprobante>
         <tipoComprobante>TIPO</tipoComprobante>
         <serieComprobante>SERIE</serieComprobante>
         <numeroComprobante>SECUENCIAL</numeroComprobante>
      </m:getStatusCdr>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>